notes/flatpak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Flatpak</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/about/about'>About</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">Flatpak</h1>

<div id="outline-container-org42c550d" class="outline-2">
<h2 id="org42c550d">Flatpak</h2>
<div class="outline-text-2" id="text-org42c550d">
<p>
I use Flatpak as an alternative package manager to <a href="guix.html#ID-4ce84157-a404-40fa-bdb8-0b3923916969">Guix</a> as sometimes the <a href="guix.html#ID-4ce84157-a404-40fa-bdb8-0b3923916969">Guix</a> package is flawed or not existant.
</p>
</div>
<div id="outline-container-org4b05aee" class="outline-3">
<h3 id="org4b05aee">Installation</h3>
<div class="outline-text-3" id="text-org4b05aee">
<p>
You can install a Flatpak on servers as Flatpak is decentalized technology.
You should mainly use <a target='_blank' rel='noopener noreferrer' class='external' href="https://flathub.org/home">Flathub</a>.
</p>

<p>
You can see the command you have to run to install a Flatpack at the bottom of the webpage.
</p>

<p>
The command is something resembling this:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ flatpak install flathub com.mojang.Minecraft
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaf24341" class="outline-3">
<h3 id="orgaf24341">Run</h3>
<div class="outline-text-3" id="text-orgaf24341">
<p>
Running a Flatpak application is different to a normal application.
You can see the command you have to run if you scroll to the bottom of the webpage.
</p>

<p>
The command to run a Flatpack application resembles this.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ flatpak run io.gdevs.GDLauncher
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgedb310f" class="outline-2">
<h2 id="orgedb310f">Links to this note</h2>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:x7and7@gmail.com'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgroam in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
